<script setup lang="ts">

</script>

<template>
  <header>
    <h1>IT Professionals Work</h1>
  </header>

  <main>
    <section>
      <h2>Политика конфиденциальности</h2>

      <p>Последнее обновление: [дата]</p>

      <p>Добро пожаловать на сайт IT Professionals Work. Наша компания обязуется обеспечивать конфиденциальность
        ваших личных данных в соответствии с настоящей политикой конфиденциальности.</p>

      <p>
        **1. Сбор и использование информации**
        1.1. Мы собираем информацию, предоставляемую вами при регистрации на сайте, заполнении анкет, загрузке резюме, отправке запросов или взаимодействии с нашими услугами.
        1.2. Мы можем использовать предоставленные вами данные для связи с вами, предоставления услуг и улучшения функционала нашего сайта.

        **2. Защита данных**
        2.1. Мы принимаем меры для обеспечения безопасности ваших данных и предотвращения их неправомерного доступа, использования или раскрытия.
        2.2. Мы не передаем ваши личные данные третьим лицам без вашего согласия, за исключением случаев, предусмотренных законом.

        **3. Использование файлов cookie**
        3.1. Мы можем использовать файлы cookie для улучшения опыта пользователей, анализа трафика и персонализации контента.
        3.2. Вы можете отключить файлы cookie в настройках вашего браузера, однако это может повлиять на функциональность сайта.

        **4. Резюме и профили**
        4.1. Резюме и профили, размещенные на сайте, могут быть доступны работодателям и рекрутерам. Мы прилагаем усилия для защиты ваших данных, но не можем гарантировать полную безопасность.

        **5. Изменения в политике конфиденциальности**
        5.1. Мы оставляем за собой право вносить изменения в нашу политику конфиденциальности. Любые изменения будут опубликованы на сайте.

        **6. Ваши права**
        6.1. Вы имеете право запросить доступ к своим личным данным, внести изменения или удалить их.

        6.2. Если у вас есть вопросы или предложения по поводу нашей политики конфиденциальности, свяжитесь с нами по адресу [ваш контактный адрес].

        Надеемся на долгосрочное и взаимовыгодное сотрудничество с вами. Благодарим за доверие к IT Professionals Work!
      </p>

    </section>
  </main>

  <footer>
    <p>Надеемся на долгосрочное и взаимовыгодное сотрудничество с вами. Благодарим за доверие к IT Professionals
      Work!</p>
  </footer>
</template>

<style scoped>
body {
  font-family: Arial, sans-serif;
  margin: 0;
  padding: 0;
}

header {
  background-color: #333;
  color: white;
  text-align: center;
  padding: 1em 0;
}

main {
  max-width: 800px;
  margin: 20px auto;
  padding: 0 20px;
}

section {
  margin-bottom: 20px;
}

h2 {
  color: #333;
}

footer {
  background-color: #333;
  color: white;
  text-align: center;
  padding: 1em 0;
}

</style>